src/cf/src/DataProcessors/ЗагрузкаСтанков/ЗагрузкаСтанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаСтанков</name>
</mdclass:DataProcessor>

src/cf/src/InformationRegisters/ЗагрузкаСтанков/ЗагрузкаСтанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗагрузкаСтанков</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидЗаписи</name>
    <type>
      <types>EnumRef.ВидыЗагрузкиСтанков</types>
    </type>
  </resources>
  <resources>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Documents/ОбслуживаниеСтанка/ОбслуживаниеСтанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбслуживаниеСтанка</name>
  <registerRecords>InformationRegister.ЗагрузкаСтанков</registerRecords>
  <attributes>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбслуживания</name>
    <type>
      <types>EnumRef.ВидыОбслуживанияСтанков</types>
    </type>
  </attributes>
  <attributes>
    <name>Плановое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Затраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/cf/src/DataProcessors/ЗагрузкаСтанков/Forms/ПробаПланировщика/Module.bsl
// Проба поля «Планировщик» (учёт станков, сборка 1): станки - измерение, записи «Загрузки станков» - элементы,
// нерабочее время по режиму станка - фон. Перетаскивание элемента переносит документ обслуживания. Форма без
// меню и без связи с рабочим местом производства: по ней решается, годится ли планировщик для закладки
// «Станки» (сборка 3) или нужен табличный документ.
//
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НеделяС = НачалоНедели(ТекущаяДатаСеанса());
	ЗаполнитьПланировщик();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НеделяСПриИзменении(Элемент)

	ЗаполнитьПланировщикНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)

	// Перетаскивание и растяжение элемента: документ обслуживания переносится и перепроводится, пересечение с
	// занятым временем станка отклоняет перенос, и элемент возвращается на место.
	Если НовыйЭлемент Тогда
		ОтменаРедактирования = Истина;
		Возврат;
	КонецЕсли;
	Для Каждого ЭлементПланировщика Из Элемент.ВыделенныеЭлементы Цикл
		Станок = ЭлементПланировщика.ЗначенияИзмерений.Получить("Станок");
		ТекстОшибки = ПеренестиЗагрузку(ЭлементПланировщика.Значение, Станок, ЭлементПланировщика.Начало,
			ЭлементПланировщика.Конец);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			// Часть выделенных элементов могла уже перенестись: планировщик перечитывается из базы.
			ОтменаРедактирования = Истина;
			ЗаполнитьПланировщикНаСервере();
			ПоказатьПредупреждение(, ТекстОшибки);
			Возврат;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПланировщикНаСервере()

	ЗаполнитьПланировщик();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПланировщик()

	Начало = НачалоДня(НеделяС);
	Окончание = КонецНедели(Начало) + 1;
	Станки = ДействующиеСтанки();

	Планировщик.Элементы.Очистить();
	Планировщик.Измерения.Очистить();
	Планировщик.ИнтервалыФона.Очистить();
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Планировщик.ТекущиеПериодыОтображения.Добавить(Начало, Окончание);
	Планировщик.ОтображениеВремениЭлементов = ОтображениеВремениЭлементовПланировщика.ВремяНачалаИКонца;
	// Станки - строками, время - слева направо одной лентой на неделю, без переноса по суткам.
	Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Неделя;
	Планировщик.КратностьПериодическогоВарианта = 1;
	Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Верх;
	НастроитьШкалуВремени();

	Измерение = Планировщик.Измерения.Добавить("Станок", НСтр("ru = 'Станок'; fr = 'Machine'; en = 'Machine'; es = 'Máquina'"));
	Для Каждого Станок Из Станки Цикл
		Измерение.Элементы.Добавить(Станок, Строка(Станок));
	КонецЦикла;

	ДобавитьНерабочееВремя(Станки, Начало, Окончание);
	ДобавитьЗаписиЗагрузки(Станки, Начало, Окончание);

КонецПроцедуры

&НаСервере
Процедура НастроитьШкалуВремени()

	ЭлементыШкалы = Планировщик.ШкалаВремени.Элементы;
	Если ЭлементыШкалы.Количество() = 0 Тогда
		ЭлементыШкалы.Добавить();
	КонецЕсли;
	ШкалаДней = ЭлементыШкалы.Получить(0);
	ШкалаДней.Единица = ТипЕдиницыШкалыВремени.День;
	ШкалаДней.Кратность = 1;
	ШкалаЧасов = ?(ЭлементыШкалы.Количество() > 1, ЭлементыШкалы.Получить(1), ЭлементыШкалы.Добавить());
	ШкалаЧасов.Единица = ТипЕдиницыШкалыВремени.Час;
	ШкалаЧасов.Кратность = ЧасовВДеленииШкалы();

КонецПроцедуры

&НаСервере
Процедура ДобавитьНерабочееВремя(Станки, Начало, Окончание)

	// Фон - нерабочее время каждого станка: дополнение рабочих интервалов режима до недели.
	ЦветНерабочего = WebЦвета.СветлоСерый;
	Интервалы = ЗагрузкаСтанков.ИнтервалыРаботыСтанков(Станки, Начало, Окончание);
	Для Каждого Станок Из Станки Цикл
		Свободно = Начало;
		Для Каждого Интервал Из Интервалы.НайтиСтроки(Новый Структура("Станок", Станок)) Цикл
			Если Интервал.Начало > Свободно Тогда
				ДобавитьИнтервалФона(Станок, Свободно, Интервал.Начало, ЦветНерабочего);
			КонецЕсли;
			Свободно = Интервал.Окончание;
		КонецЦикла;
		Если Свободно < Окончание Тогда
			ДобавитьИнтервалФона(Станок, Свободно, Окончание, ЦветНерабочего);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьИнтервалФона(Станок, Начало, Окончание, Цвет)

	Интервал = Планировщик.ИнтервалыФона.Добавить(Начало, Окончание);
	Интервал.Цвет = Цвет;
	Интервал.ЗначенияИзмерений = ЗначенияИзмерений(Станок);

КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписиЗагрузки(Станки, Начало, Окончание)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Загрузка.Станок КАК Станок,
	|	Загрузка.Начало КАК Начало,
	|	Загрузка.Окончание КАК Окончание,
	|	Загрузка.План КАК План,
	|	Загрузка.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(Обслуживание.ВидОбслуживания) КАК Вид,
	|	Обслуживание.Причина КАК Причина
	|ИЗ
	|	РегистрСведений.ЗагрузкаСтанков КАК Загрузка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбслуживаниеСтанка КАК Обслуживание
	|		ПО Загрузка.Регистратор = Обслуживание.Ссылка
	|ГДЕ
	|	Загрузка.Станок В(&Станки)
	|	И Загрузка.Начало < &Окончание
	|	И Загрузка.Окончание > &Начало";
	Запрос.УстановитьПараметр("Станки", Станки);
	Запрос.УстановитьПараметр("Начало", Начало);
	Запрос.УстановитьПараметр("Окончание", Окончание);
	Выборка = Запрос.Выполнить().Выбрать();
	ЦветПлана = WebЦвета.Голубой;
	ЦветФакта = WebЦвета.ТемноСерый;
	Пока Выборка.Следующий() Цикл
		ЭлементПланировщика = Планировщик.Элементы.Добавить(Выборка.Начало, Выборка.Окончание);
		ЭлементПланировщика.Значение = Выборка.Регистратор;
		ЭлементПланировщика.Текст = Выборка.Вид + ?(ПустаяСтрока(Выборка.Причина), "", ": " + Выборка.Причина);
		ЭлементПланировщика.ЦветФона = ?(Выборка.План, ЦветПлана, ЦветФакта);
		ЭлементПланировщика.ЗначенияИзмерений = ЗначенияИзмерений(Выборка.Станок);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ДействующиеСтанки()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Станки.Ссылка КАК Станок
	|ИЗ
	|	Справочник.ПроизводственноеОборудование КАК Станки
	|ГДЕ
	|	НЕ Станки.ПометкаУдаления
	|	И НЕ Станки.Выведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Станки.Наименование";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Станок");

КонецФункции

&НаСервереБезКонтекста
Функция ЧасовВДеленииШкалы()

	Возврат 4;

КонецФункции

&НаСервереБезКонтекста
Функция ЗначенияИзмерений(Станок)

	Значения = Новый Соответствие;
	Значения.Вставить("Станок", Станок);
	Возврат Новый ФиксированноеСоответствие(Значения);

КонецФункции

// Перенос записи загрузки: в сборке 1 загрузку пишет только «Обслуживание станка» - документ получает новое
// время и станок и перепроводится; отказ проведения (пересечение) возвращается текстом.
//
// Параметры:
//  Регистратор - ДокументСсылка.ОбслуживаниеСтанка - документ элемента
//  Станок      - СправочникСсылка.ПроизводственноеОборудование - станок строки, куда перетащили
//  Начало      - Дата - новое начало
//  Окончание   - Дата - новое окончание
//
// Возвращаемое значение:
//  Строка - текст ошибки; пустая строка - перенесено
//
&НаСервереБезКонтекста
Функция ПеренестиЗагрузку(Знач Регистратор, Знач Станок, Знач Начало, Знач Окончание)

	Если ТипЗнч(Регистратор) <> Тип("ДокументСсылка.ОбслуживаниеСтанка") Тогда
		Возврат НСтр("ru = 'Этот элемент не переносится'; fr = 'Cet élément ne se déplace pas';
			|en = 'This item cannot be moved'; es = 'Este elemento no se puede mover'");
	КонецЕсли;
	ДокументОбъект = Регистратор.ПолучитьОбъект();
	ДокументОбъект.Начало = Начало;
	ДокументОбъект.Окончание = Окончание;
	Если ЗначениеЗаполнено(Станок) Тогда
		ДокументОбъект.Станок = Станок;
	КонецЕсли;
	ПолучитьСообщенияПользователю(Истина);
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Тексты = Новый Массив;
		Для Каждого Сообщение Из ПолучитьСообщенияПользователю(Истина) Цикл
			Тексты.Добавить(Сообщение.Текст);
		КонецЦикла;
		Если Тексты.Количество() = 0 Тогда
			Тексты.Добавить(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецЕсли;
		Возврат СтрСоединить(Тексты, Символы.ПС);
	КонецПопытки;
	Возврат "";

КонецФункции

#КонецОбласти
